sterentev/atdf-device-asm-include/inc/AT90USB646.inc
; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit



; ====	USART MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register UCSR1A bits		------------------------
.equ	RXC1		= 7		; 0x80 - USART Receive Complete
.equ	TXC1		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE1		= 5		; 0x20 - USART Data Register Empty
.equ	FE1		= 4		; 0x10 - Framing Error
.equ	DOR1		= 3		; 0x08 - Data overRun
.equ	UPE1		= 2		; 0x04 - Parity Error
.equ	U2X1		= 1		; 0x02 - Double the USART transmission speed
.equ	MPCM1		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR1B bits		------------------------
.equ	RXCIE1		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE1		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE1		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN1		= 4		; 0x10 - Receiver Enable
.equ	TXEN1		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ12		= 2		; 0x04 - Character Size
.equ	RXB81		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB81		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR1C bits		------------------------
.equ	UMSEL1_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL10		= 6		;          UMSEL1 BIT0 position
.equ	UPM1_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM10		= 4		;          UPM1 BIT0 position
.equ	USBS1		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ1_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ10		= 1		;          UCSZ1 BIT0 position
.equ	UCPOL1		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL1	:::: bitfield values
;			0x00		; Asynchronous USART
;			0x40		; Synchronous USART
;			0xC0		; Master SPI
; ::::  UPM1	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS1	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit



; ====	USB_DEVICE MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register UEIENX bits		------------------------
.equ	FLERRE		= 7		; 0x80 - 
.equ	NAKINE		= 6		; 0x40 - 
.equ	NAKOUTE		= 4		; 0x10 - 
.equ	RXSTPE		= 3		; 0x08 - 
.equ	RXOUTE		= 2		; 0x04 - 
.equ	STALLEDE	= 1		; 0x02 - 
.equ	TXINE		= 0		; 0x01 - 

; ----------	Register UESTA1X bits		------------------------
.equ	CTRLDIR		= 2		; 0x04 - 
.equ	CURRBK_MASK	= 0x03		;      -  (2 bits)
.equ	CURRBK0		= 0		;          CURRBK BIT0 position

; ----------	Register UESTA0X bits		------------------------
.equ	CFGOK		= 7		; 0x80 - 
.equ	OVERFI		= 6		; 0x40 - 
.equ	UNDERFI		= 5		; 0x20 - 
.equ	DTSEQ_MASK	= 0x0C		;      -  (2 bits)
.equ	DTSEQ0		= 2		;          DTSEQ BIT0 position
.equ	NBUSYBK_MASK	= 0x03		;      -  (2 bits)
.equ	NBUSYBK0	= 0		;          NBUSYBK BIT0 position

; ----------	Register UECFG1X bits		------------------------
.equ	EPSIZE_MASK	= 0x70		;      -  (3 bits)
.equ	EPSIZE0		= 4		;          EPSIZE BIT0 position
.equ	EPBK_MASK	= 0x0C		;      -  (2 bits)
.equ	EPBK0		= 2		;          EPBK BIT0 position
.equ	ALLOC		= 1		; 0x02 - 

; ----------	Register UECFG0X bits		------------------------
.equ	EPTYPE_MASK	= 0xC0		;      -  (2 bits)
.equ	EPTYPE0		= 6		;          EPTYPE BIT0 position
.equ	EPDIR		= 0		; 0x01 - 

; ----------	Register UECONX bits		------------------------
.equ	STALLRQ		= 5		; 0x20 - 
.equ	STALLRQC	= 4		; 0x10 - 
.equ	RSTDT		= 3		; 0x08 - 
.equ	EPEN		= 0		; 0x01 - 

; ----------	Register UERST bits		------------------------
.equ	EPRST_MASK	= 0x7F		;      -  (7 bits)
.equ	EPRST0		= 0		;          EPRST BIT0 position

; ----------	Register UEINTX bits		------------------------
.equ	FIFOCON		= 7		; 0x80 - 
.equ	NAKINI		= 6		; 0x40 - 
.equ	RWAL		= 5		; 0x20 - 
.equ	NAKOUTI		= 4		; 0x10 - 
.equ	RXSTPI		= 3		; 0x08 - 
.equ	RXOUTI		= 2		; 0x04 - 
.equ	STALLEDI	= 1		; 0x02 - 
.equ	TXINI		= 0		; 0x01 - 

; ----------	Register UDMFN bits		------------------------
.equ	FNCERR		= 4		; 0x10 - 

; ----------	Register UDADDR bits		------------------------
.equ	ADDEN		= 7		; 0x80 - 
.equ	UADD_MASK	= 0x7F		;      -  (7 bits)
.equ	UADD0		= 0		;          UADD BIT0 position

; ----------	Register UDIEN bits		------------------------
.equ	UPRSME		= 6		; 0x40 - 
.equ	EORSME		= 5		; 0x20 - 
.equ	WAKEUPE		= 4		; 0x10 - 
.equ	EORSTE		= 3		; 0x08 - 
.equ	SOFE		= 2		; 0x04 - 
.equ	SUSPE		= 0		; 0x01 - 

; ----------	Register UDINT bits		------------------------
.equ	UPRSMI		= 6		; 0x40 - 
.equ	EORSMI		= 5		; 0x20 - 
.equ	WAKEUPI		= 4		; 0x10 - 
.equ	EORSTI		= 3		; 0x08 - 
.equ	SOFI		= 2		; 0x04 - 
.equ	SUSPI		= 0		; 0x01 - 

; ----------	Register UDCON bits		------------------------
.equ	LSM		= 2		; 0x04 - 
.equ	RMWKUP		= 1		; 0x02 - 
.equ	DETACH		= 0		; 0x01 - 



; ====	USB_GLOBAL MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register OTGINT bits		------------------------
.equ	STOI		= 5		; 0x20 - 
.equ	HNPERRI		= 4		; 0x10 - 
.equ	ROLEEXI		= 3		; 0x08 - 
.equ	BCERRI		= 2		; 0x04 - 
.equ	VBERRI		= 1		; 0x02 - 
.equ	SRPI		= 0		; 0x01 - 

; ----------	Register OTGIEN bits		------------------------
.equ	STOE		= 5		; 0x20 - 
.equ	HNPERRE		= 4		; 0x10 - 
.equ	ROLEEXE		= 3		; 0x08 - 
.equ	BCERRE		= 2		; 0x04 - 
.equ	VBERRE		= 1		; 0x02 - 
.equ	SRPE		= 0		; 0x01 - 

; ----------	Register OTGCON bits		------------------------
.equ	HNPREQ		= 5		; 0x20 - 
.equ	SRPREQ		= 4		; 0x10 - 
.equ	SRPSEL		= 3		; 0x08 - 
.equ	VBUSHWC		= 2		; 0x04 - 
.equ	VBUSREQ		= 1		; 0x02 - 
.equ	VBUSRQC		= 0		; 0x01 - 

; ----------	Register OTGTCON bits		------------------------
.equ	OTGTCON_7	= 7		; 0x80 - 
.equ	PAGE_MASK	= 0x60		;      -  (2 bits)
.equ	PAGE0		= 5		;          PAGE BIT0 position
.equ	VALUE_2_MASK	= 0x07		;      -  (3 bits)
.equ	VALUE_20	= 0		;          VALUE_2 BIT0 position

; ----------	Register USBINT bits		------------------------
.equ	IDTI		= 1		; 0x02 - 
.equ	VBUSTI		= 0		; 0x01 - 

; ----------	Register USBSTA bits		------------------------
.equ	SPEED		= 3		; 0x08 - 
.equ	ID		= 1		; 0x02 - 
.equ	VBUS		= 0		; 0x01 - 

