sterentev/atdf-device-asm-include/inc/AT90USB646.inc
; ----------	Register USBCON bits		------------------------
.equ	USBE		= 7		; 0x80 - 
.equ	HOST		= 6		; 0x40 - 
.equ	FRZCLK		= 5		; 0x20 - 
.equ	OTGPADE		= 4		; 0x10 - 
.equ	IDTE		= 1		; 0x02 - 
.equ	VBUSTE		= 0		; 0x01 - 

; ----------	Register UHWCON bits		------------------------
.equ	UIMOD		= 7		; 0x80 - 
.equ	UIDE		= 6		; 0x40 - 
.equ	UVCONE		= 4		; 0x10 - 
.equ	UVREGE		= 0		; 0x01 - 



; ====	USB_HOST MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register UPERRX bits		------------------------
.equ	COUNTER_MASK	= 0x60		;      -  (2 bits)
.equ	COUNTER0	= 5		;          COUNTER BIT0 position
.equ	CRC16		= 4		; 0x10 - 
.equ	TIMEOUT		= 3		; 0x08 - 
.equ	PID		= 2		; 0x04 - 
.equ	DATAPID		= 1		; 0x02 - 
.equ	DATATGL		= 0		; 0x01 - 

; ----------	Register UPIENX bits		------------------------
;.equ	FLERRE		= 7		; 0x80 - 
.equ	NAKEDE		= 6		; 0x40 - 
.equ	PERRE		= 4		; 0x10 - 
.equ	TXSTPE		= 3		; 0x08 - 
.equ	TXOUTE		= 2		; 0x04 - 
.equ	RXSTALLE	= 1		; 0x02 - 
.equ	RXINE		= 0		; 0x01 - 

; ----------	Register UPSTAX bits		------------------------
;.equ	CFGOK		= 7		; 0x80 - 
;.equ	OVERFI		= 6		; 0x40 - 
;.equ	UNDERFI		= 5		; 0x20 - 
;.equ	DTSEQ_MASK	= 0x0C		;      -  (2 bits)
;.equ	DTSEQ0		= 2		;          DTSEQ BIT0 position
.equ	NBUSYK_MASK	= 0x03		;      -  (2 bits)
.equ	NBUSYK0		= 0		;          NBUSYK BIT0 position

; ----------	Register UPCFG1X bits		------------------------
.equ	PSIZE_MASK	= 0x70		;      -  (3 bits)
.equ	PSIZE0		= 4		;          PSIZE BIT0 position
.equ	PBK_MASK	= 0x0C		;      -  (2 bits)
.equ	PBK0		= 2		;          PBK BIT0 position
;.equ	ALLOC		= 1		; 0x02 - 

; ----------	Register UPCFG0X bits		------------------------
.equ	PTYPE_MASK	= 0xC0		;      -  (2 bits)
.equ	PTYPE0		= 6		;          PTYPE BIT0 position
.equ	PTOKEN_MASK	= 0x30		;      -  (2 bits)
.equ	PTOKEN0		= 4		;          PTOKEN BIT0 position
.equ	PEPNUM_MASK	= 0x0F		;      -  (4 bits)
.equ	PEPNUM0		= 0		;          PEPNUM BIT0 position

; ----------	Register UPCONX bits		------------------------
.equ	PFREEZE		= 6		; 0x40 - 
.equ	INMODE		= 5		; 0x20 - 
;.equ	RSTDT		= 3		; 0x08 - 
.equ	PEN		= 0		; 0x01 - 

; ----------	Register UPRST bits		------------------------
.equ	PRST_MASK	= 0x7F		;      -  (7 bits)
.equ	PRST0		= 0		;          PRST BIT0 position

; ----------	Register UPINTX bits		------------------------
;.equ	FIFOCON		= 7		; 0x80 - 
.equ	NAKEDI		= 6		; 0x40 - 
;.equ	RWAL		= 5		; 0x20 - 
.equ	PERRI		= 4		; 0x10 - 
.equ	TXSTPI		= 3		; 0x08 - 
.equ	TXOUTI		= 2		; 0x04 - 
.equ	RXSTALLI	= 1		; 0x02 - 
.equ	RXINI		= 0		; 0x01 - 

; ----------	Register UHIEN bits		------------------------
.equ	HWUPE		= 6		; 0x40 - 
.equ	HSOFE		= 5		; 0x20 - 
.equ	RXRSME		= 4		; 0x10 - 
.equ	RSMEDE		= 3		; 0x08 - 
.equ	RSTE		= 2		; 0x04 - 
.equ	DDISCE		= 1		; 0x02 - 
.equ	DCONNE		= 0		; 0x01 - 

; ----------	Register UHINT bits		------------------------
.equ	UHUPI		= 6		; 0x40 - 
.equ	HSOFI		= 5		; 0x20 - 
.equ	RXRSMI		= 4		; 0x10 - 
.equ	RSMEDI		= 3		; 0x08 - 
.equ	RSTI		= 2		; 0x04 - 
.equ	DDISCI		= 1		; 0x02 - 
.equ	DCONNI		= 0		; 0x01 - 

; ----------	Register UHCON bits		------------------------
.equ	RESUME		= 2		; 0x04 - 
.equ	RESET		= 1		; 0x02 - 
.equ	SOFEN		= 0		; 0x01 - 



; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read While Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read While Write section read enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EECR bits		------------------------
.equ	EEPM_MASK	= 0x30		;      - EEPROM Programming Mode Bits (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEPROM Ready Interrupt Enable
.equ	EEMPE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEPE		= 1		; 0x02 - EEPROM Write Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable
; ::::  EEPM	:::: bitfield values
;			0x00		; Erase and Write in one operation
;			0x10		; Erase Only
;			0x20		; Write Only



; ====	TC8 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR0B bits		------------------------
.equ	FOC0A		= 7		; 0x80 - Force Output Compare A
.equ	FOC0B		= 6		; 0x40 - Force Output Compare B
.equ	WGM02		= 3		; 0x08 - 
.equ	CS0_MASK	= 0x07		;      - Clock Select (3 bits)
.equ	CS00		= 0		;          CS0 BIT0 position
; ::::  CS0	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCCR0A bits		------------------------
.equ	COM0A_MASK	= 0xC0		;      - Compare Output Mode, Phase Correct PWM Mode (2 bits)
.equ	COM0A0		= 6		;          COM0A BIT0 position
.equ	COM0B_MASK	= 0x30		;      - Compare Output Mode, Fast PWm (2 bits)
.equ	COM0B0		= 4		;          COM0B BIT0 position
.equ	WGM0_MASK	= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	WGM00		= 0		;          WGM0 BIT0 position

; ----------	Register TIMSK0 bits		------------------------
.equ	OCIE0B		= 2		; 0x04 - Timer/Counter0 Output Compare Match B Interrupt Enable
.equ	OCIE0A		= 1		; 0x02 - Timer/Counter0 Output Compare Match A Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Timer/Counter0 Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	OCF0B		= 2		; 0x04 - Timer/Counter0 Output Compare Flag 0B
.equ	OCF0A		= 1		; 0x02 - Timer/Counter0 Output Compare Flag 0A
.equ	TOV0		= 0		; 0x01 - Timer/Counter0 Overflow Flag

; ----------	Register GTCCR bits		------------------------
.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset Timer/Counter1 and Timer/Counter0



